// ========================================
// Поверхносное копирование обьекта, не копирует вложенные обьекты, а только те которые лежат на первом уровне
// Способ с цыклами
// ========================================

// Функция создающая клон
function copy(mainObj){
  let objCopy = {};

  let key;
  for(key in mainObj){
    objCopy[key] = mainObj[key];
  }

  return objCopy;
}

// обьект который нужно склонировать
let numbers = {
  a: 5,
  b: 7,
  c: {
    x: 'seven',
    y: 4
  }
};

// Клон
const newNumbers = copy(numbers);

// ========================================
// Поверхносное копирование обьекта, соединяем несколько обьектов
// Object.assign()
// ========================================

const oneObj = {
  a: 5,
  b: 7,
  c: {
    x: 'seven',
    y: 4
  }
};

const twoObj = {
  d: 17,
  e: 20
};

// Слияние двух обьектов и создание поверхносной копии

let clone = Object.assign(oneObj, twoObj); // { a: 5, b: 7, c: { x: 'seven', y: 4 }, d: 17, e: 20 }

//========== Просто создание поверхносной копии

let onlyClone = Object.assign({}, twoObj); // { d: 17, e: 20 }


// ========================================
// Создание копии массива
// ========================================

const oldArray = ['a', 'b', 'c'];

// копируем массив
const newArray = oldArray.slice();

// ========================================
// Создание поверхносной копии, новые стандарты ES6-ES9
// операторы разворота(спред оператор)
// ========================================

const video = ['youtube', 'vimeo', 'rutube'],
      blogs = ['wordpress', 'livejournal', 'blogger'];

// копируем 2 массива в один
const internet = [...video, ...blogs];

// копируем 2 массива в один + свои данные
const internetTwo = [...video, ...blogs, 'vk', 'fackebook'];

// ========================================
// Передаем в аргументы функции массив
// операторы разворота(спред оператор)
// ========================================

function log(a, b, c){
  console.log(a);
  console.log(b);
  console.log(c);
}

const num = [2, 7, 8];

log(...num); // 2  7  8

// ========================================
// Создание поверхносных копий МАССИВОВ, четвертый способ
// операторы разворота(спред оператор)
// ========================================

const array = ['a', 'b'];

const arrayNew = [...array]; // [ 'a', 'b' ]

// ========================================
// Создание поверхносных копий ОБЬЕКТОВ, четвертый способ
// операторы разворота(спред оператор)
// ========================================

const q = {
  one: 1,
  two: 2
};

const newQ = {...q}; // { one: 1, two: 2 }

