'use strict';

//Создаес обьект даты, текущая дата
const now = new Date(); // 2020-09-04T15:32:11.708Z

// =======================================
// =======================================

//передаем дату, можно передать inpet type=date
const now2 = new Date('2020-09-04'); // 2020-09-04T00:00:00.000Z

// =======================================
// =======================================

//Начало отсчета даты, начинает 1970г, отсчет всегла в милисекундах
const now3 = new Date(0); // 1970-01-01T00:00:00.000Z

// =======================================
// =======================================

//получение года
const now4 = new Date();
now4.getFullYear(); // 2020

// =======================================
// =======================================

//получение месяца, отсчет от 0
const now5 = new Date();
now5.getMonth(); // 8

// =======================================
// =======================================

//получение числа
const now6 = new Date();
now6.getDate(); // 4

// =======================================
// =======================================

//получение часов
const now7 = new Date();
now7.getHours(); //18

// =======================================
// =======================================

//получение минут
const now8 = new Date();
now8.getMinutes(); //47

// =======================================
// =======================================

//получение секунд
const now9 = new Date();
now9.getMinutes(); // 58

// =======================================
// =======================================

//получение номер дня недели, начало с воскресениия (0)
const now10 = new Date();
now10.getDay(); // 5

// =======================================
// =======================================

//количество милисек прошедших с 1970
const now11 = new Date();
now11.getTime(); //1599234868689

// =======================================
// =======================================

//установка времени
const now12 = new Date();
now12.setHours(13);
console.log(now12); //Fri Sep 04 2020 13:05:01 GMT+0300 (Москва, стандартное время)

// =======================================
// =======================================

//Вычисляем за сколько отработал цикл, просто ставим функу между двумя датами, и потов отнимаем вторую от первой даты, и разница в милисеках

// ** возвести в степень

let start = new Date();

for(let i = 0; i < 100000; i++){
  let some = i ** 3;
}

let end = new Date();

console.log(`Цыкл отработал за ${end - start} миллисекунд`);  //Цыкл отработал за 10 миллисекунд